{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d3a81544-b753-4983-9c02-91e3181b1e3e",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/maru/micromamba/envs/textmining/lib/python3.10/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "from pprint import pprint\n",
    "from convertmol import parse_sdf_file, bond_type_dict, single_bond_stereo_dict, double_bond_stereo_dict\n",
    "from torch_geometric.data import Data\n",
    "from torch_geometric.nn import *\n",
    "from torch_geometric.utils import to_dense_adj, to_dense_batch, add_self_loops\n",
    "from torch_geometric.nn.conv import MessagePassing\n",
    "import torch\n",
    "from torch import nn\n",
    "import rdkit\n",
    "from tqdm import tqdm\n",
    "import itertools\n",
    "from rdkit import Chem\n",
    "import pandas as pd\n",
    "from importlib import reload\n",
    "import matplotlib.pyplot as plt\n",
    "from rdkit import RDLogger\n",
    "from copy import deepcopy\n",
    "from torch.utils.data import Dataset, DataLoader\n",
    "# Suppress RDKit warnings\n",
    "RDLogger.DisableLog('rdApp.*')\n",
    "import sascorer\n",
    "torch.set_default_device('cpu:0')#'cuda'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "7089ea20-76b3-4ce7-a75b-d72ee852ca69",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "e8b18006-057b-4cbd-93dd-9ac003e8c206",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, RoutingControl\n",
    "\n",
    "\n",
    "URI = \"bolt://localhost:7687\"\n",
    "AUTH = (\"neo4j\", \"password\")\n",
    "\n",
    "\n",
    "def add_friend(driver, name, friend_name):\n",
    "    driver.execute_query(\n",
    "        \"MERGE (a:Person {name: $name}) \"\n",
    "        \"MERGE (friend:Person {name: $friend_name}) \"\n",
    "        \"MERGE (a)-[:KNOWS]->(friend)\",\n",
    "        name=name, friend_name=friend_name, database_=\"neo4j\",\n",
    "    )\n",
    "\n",
    "\n",
    "def print_friends(driver, name):\n",
    "    records, _, _ = driver.execute_query(\n",
    "        \"MATCH (a:Person)-[:KNOWS]->(friend) WHERE a.name = $name \"\n",
    "        \"RETURN friend.name ORDER BY friend.name\",\n",
    "        name=name, database_=\"neo4j\", routing_=RoutingControl.READ,\n",
    "    )\n",
    "    for record in records:\n",
    "        print(record[\"friend.name\"])\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "4ff9a92b-1142-4ca6-b668-9a9da3d45bc0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "A\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    print(\"A\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "5cef7811-4a8f-4006-a7d7-1d95199dfdd2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<module 'convertmol' from '/home/maru/Desktop/biocheminformatics/convertmol.py'>"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import convertmol\n",
    "import importlib\n",
    "importlib.reload(convertmol)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "c75e1b19-6129-43d3-9c03-79817428d6b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'id': 'gdb_1',\n",
       " 'software': '-OEChem-03231823243D',\n",
       " 'version': 'V2000',\n",
       " 'atom1': {'x': -0.0127,\n",
       "  'y': 1.0858,\n",
       "  'z': 0.008,\n",
       "  'symbol': 'C',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom2': {'x': 0.0022,\n",
       "  'y': -0.006,\n",
       "  'z': 0.002,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom3': {'x': 1.0117,\n",
       "  'y': 1.4638,\n",
       "  'z': 0.0003,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom4': {'x': -0.5408,\n",
       "  'y': 1.4475,\n",
       "  'z': -0.8766,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom5': {'x': -0.5238,\n",
       "  'y': 1.4379,\n",
       "  'z': 0.9064,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'bond0': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom2'},\n",
       " 'bond1': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom3'},\n",
       " 'bond2': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom4'},\n",
       " 'bond3': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom5'}}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'id': 'gdb_2',\n",
       " 'software': '-OEChem-03231823233D',\n",
       " 'version': 'V2000',\n",
       " 'atom1': {'x': -0.0404,\n",
       "  'y': 1.0241,\n",
       "  'z': 0.0626,\n",
       "  'symbol': 'N',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom2': {'x': 0.0173,\n",
       "  'y': 0.0125,\n",
       "  'z': -0.0274,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom3': {'x': 0.9158,\n",
       "  'y': 1.3587,\n",
       "  'z': -0.0288,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom4': {'x': -0.5203,\n",
       "  'y': 1.3435,\n",
       "  'z': -0.7755,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'bond0': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom2'},\n",
       " 'bond1': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom3'},\n",
       " 'bond2': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom4'}}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'id': 'gdb_3',\n",
       " 'software': '-OEChem-03231823243D',\n",
       " 'version': 'V2000',\n",
       " 'atom1': {'x': -0.0344,\n",
       "  'y': 0.9775,\n",
       "  'z': 0.0076,\n",
       "  'symbol': 'O',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom2': {'x': 0.0648,\n",
       "  'y': 0.0206,\n",
       "  'z': 0.0015,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom3': {'x': 0.8718,\n",
       "  'y': 1.3008,\n",
       "  'z': 0.0007,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'bond0': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom2'},\n",
       " 'bond1': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom3'}}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'id': 'gdb_4',\n",
       " 'software': '-OEChem-03231823253D',\n",
       " 'version': 'V2000',\n",
       " 'atom1': {'x': 0.5995,\n",
       "  'y': 0.0,\n",
       "  'z': 1.0,\n",
       "  'symbol': 'C',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom2': {'x': -0.5995,\n",
       "  'y': 0.0,\n",
       "  'z': 1.0,\n",
       "  'symbol': 'C',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom3': {'x': -1.6616,\n",
       "  'y': 0.0,\n",
       "  'z': 1.0,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom4': {'x': 1.6616,\n",
       "  'y': 0.0,\n",
       "  'z': 1.0,\n",
       "  'symbol': 'H',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'bond0': {'bond_type': 'Triple', 'orig': 'atom1', 'dest': 'atom2'},\n",
       " 'bond1': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom4'},\n",
       " 'bond2': {'bond_type': 'Single',\n",
       "  'bond_stereo': 'Not_stereo',\n",
       "  'orig': 'atom2',\n",
       "  'dest': 'atom3'}}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "processing\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'id': 'CO2',\n",
       " 'software': 'ChemDraw2024',\n",
       " 'version': 'V2000',\n",
       " 'atom1': {'x': -0.72,\n",
       "  'y': 0.0,\n",
       "  'z': 0.0,\n",
       "  'symbol': 'C',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom2': {'x': 0.72,\n",
       "  'y': 0.0,\n",
       "  'z': 0.0,\n",
       "  'symbol': 'O',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'atom3': {'x': -1.44,\n",
       "  'y': 0.0,\n",
       "  'z': 0.0,\n",
       "  'symbol': 'O',\n",
       "  'mass_diff': '0',\n",
       "  'charge': 'outside_limits',\n",
       "  'stereo_parity': 'not_stereo',\n",
       "  'valence': 'no marking'},\n",
       " 'bond0': {'bond_type': 'Double',\n",
       "  'bond_stereo': 'Use_coordinates',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom2'},\n",
       " 'bond1': {'bond_type': 'Double',\n",
       "  'bond_stereo': 'Use_coordinates',\n",
       "  'orig': 'atom1',\n",
       "  'dest': 'atom3'},\n",
       " 'LogP': '0.83'}"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import re\n",
    "atom_re=re.compile(\"^atom\\d+$\")#.match(\"watom123\")\n",
    "bond_re=re.compile(\"^bond\\d+$\")\n",
    "\n",
    "def create_mol(tx,d,source):\n",
    "    assert isinstance(source, str), \"source must be str\"\n",
    "    atoms={}\n",
    "    bonds={}\n",
    "    props={}\n",
    "    for k,v in d.items():\n",
    "        if atom_re.match(k):\n",
    "            atoms[k]=v\n",
    "        elif bond_re.match(k):\n",
    "            bonds[k]=v\n",
    "        else:\n",
    "            props[k]=v\n",
    "    tx.run(f\"MERGE (:Source {{name: '{source}'}});\")\n",
    "    \n",
    "    mol_props = \", \".join([f\"{key}: ${key}\" for key in props.keys()])\n",
    "    query = f\"CREATE (:Molecule {{{mol_props}}});\"\n",
    "    tx.run(query, props)\n",
    "    for k, atom in atoms.items():\n",
    "        atom_props = \", \".join([f\"{key}: ${key}\" for key in atom.keys()])\n",
    "        query = f\"MATCH (m: Molecule {{id: '{props['id']}'}}) CREATE (:Atom {{id: '{k}', {atom_props}}})-[:PART_OF]->(m);\"\n",
    "        tx.run(query, atom)\n",
    "    for k, bond in bonds.items():\n",
    "        orig=bond.pop(\"orig\")\n",
    "        #orig=atoms[orig]\n",
    "        dest=bond.pop(\"dest\")\n",
    "        #dest=atoms[dest]\n",
    "        bond_props = \", \".join([f\"{key}: ${key}\" for key in bond.keys()])\n",
    "        query = f\"MATCH (orig:Atom {{id: '{orig}'}}), (dest:Atom {{id: '{dest}'}}) CREATE (orig)-[:BOND {{id: '{k}', {bond_props}}}]->(dest);\"\n",
    "        tx.run(query, bond)\n",
    "    \n",
    "    tx.run(f\"MATCH (m: Molecule {{id: '{props['id']}'}}),(s:Source {{name: '{source}'}}) CREATE (m)-[:PART_OF]->(s);\")\n",
    "    return\n",
    "    \n",
    "    #CREATE (d:Dataset {id: 'DS001', source: 'PubChem', description: 'Public chemical dataset'});\n",
    "    #\n",
    "    #CREATE (m:Molecule {id: 'MOL001', name: 'Carbon Dioxide', formula: 'CO2'})\n",
    "    #CREATE (c:Atom {type: 'C', id: 'C1', atomicNumber: 6, valency: 4})\n",
    "    #CREATE (o1:Atom {type: 'O', id: 'O1', atomicNumber: 8, valency: 2})\n",
    "    #CREATE (o2:Atom {type: 'O', id: 'O2', atomicNumber: 8, valency: 2})\n",
    "    #CREATE (c)-[:PART_OF]->(m)\n",
    "    #CREATE (o1)-[:PART_OF]->(m)\n",
    "    #CREATE (o2)-[:PART_OF]->(m);\n",
    "    #\n",
    "    #MATCH (c:Atom {id: 'C1'}), (o1:Atom {id: 'O1'})\n",
    "    #CREATE (c)-[:BOND {type: 'DOUBLE'}]->(o1);\n",
    "    #\n",
    "    #MATCH (c:Atom {id: 'C1'}), (o2:Atom {id: 'O2'})\n",
    "    #CREATE (c)-[:BOND {type: 'DOUBLE'}]->(o2);\n",
    "    #\n",
    "    #MATCH (m:Molecule {id: 'MOL001'}), (d:Dataset {id: 'DS001'})\n",
    "    #CREATE (m)-[:PART_OF]->(d);\n",
    "    #\n",
    "    ## Dynamically build Cypher query\n",
    "    #props = \", \".join([f\"{key}: ${key}\" for key in properties.keys()])\n",
    "    #query = f\"CREATE (n:{label} {{{props}}})\"\n",
    "    #tx.run(query, properties)\n",
    "\n",
    "# Use the driver\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        for m in parse_sdf_file(\"./samples.sdf\", data_items=True):\n",
    "            print(\"processing\")\n",
    "            display(m)\n",
    "            session.execute_write(create_mol, m, \"sample_gdb9\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "0fd07fd2-7495-4785-b05e-2dc7c4c9cb04",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'1{2}'"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "f\"1{{{2}}}\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "db345be7-c077-41dc-b9db-c7a42e298070",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 'gdb_1',\n",
       "  'software': '-OEChem-03231823243D',\n",
       "  'version': 'V2000',\n",
       "  'atom1': {'x': -0.0127,\n",
       "   'y': 1.0858,\n",
       "   'z': 0.008,\n",
       "   'symbol': 'C',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom2': {'x': 0.0022,\n",
       "   'y': -0.006,\n",
       "   'z': 0.002,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom3': {'x': 1.0117,\n",
       "   'y': 1.4638,\n",
       "   'z': 0.0003,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom4': {'x': -0.5408,\n",
       "   'y': 1.4475,\n",
       "   'z': -0.8766,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom5': {'x': -0.5238,\n",
       "   'y': 1.4379,\n",
       "   'z': 0.9064,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'bond0': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom2'},\n",
       "  'bond1': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom3'},\n",
       "  'bond2': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom4'},\n",
       "  'bond3': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom5'}},\n",
       " {'id': 'gdb_2',\n",
       "  'software': '-OEChem-03231823233D',\n",
       "  'version': 'V2000',\n",
       "  'atom1': {'x': -0.0404,\n",
       "   'y': 1.0241,\n",
       "   'z': 0.0626,\n",
       "   'symbol': 'N',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom2': {'x': 0.0173,\n",
       "   'y': 0.0125,\n",
       "   'z': -0.0274,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom3': {'x': 0.9158,\n",
       "   'y': 1.3587,\n",
       "   'z': -0.0288,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom4': {'x': -0.5203,\n",
       "   'y': 1.3435,\n",
       "   'z': -0.7755,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'bond0': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom2'},\n",
       "  'bond1': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom3'},\n",
       "  'bond2': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom4'}},\n",
       " {'id': 'gdb_3',\n",
       "  'software': '-OEChem-03231823243D',\n",
       "  'version': 'V2000',\n",
       "  'atom1': {'x': -0.0344,\n",
       "   'y': 0.9775,\n",
       "   'z': 0.0076,\n",
       "   'symbol': 'O',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom2': {'x': 0.0648,\n",
       "   'y': 0.0206,\n",
       "   'z': 0.0015,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom3': {'x': 0.8718,\n",
       "   'y': 1.3008,\n",
       "   'z': 0.0007,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'bond0': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom2'},\n",
       "  'bond1': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom3'}},\n",
       " {'id': 'gdb_4',\n",
       "  'software': '-OEChem-03231823253D',\n",
       "  'version': 'V2000',\n",
       "  'atom1': {'x': 0.5995,\n",
       "   'y': 0.0,\n",
       "   'z': 1.0,\n",
       "   'symbol': 'C',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom2': {'x': -0.5995,\n",
       "   'y': 0.0,\n",
       "   'z': 1.0,\n",
       "   'symbol': 'C',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom3': {'x': -1.6616,\n",
       "   'y': 0.0,\n",
       "   'z': 1.0,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom4': {'x': 1.6616,\n",
       "   'y': 0.0,\n",
       "   'z': 1.0,\n",
       "   'symbol': 'H',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'bond0': {'bond_type': 'Triple', 'orig': 'atom1', 'dest': 'atom2'},\n",
       "  'bond1': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom4'},\n",
       "  'bond2': {'bond_type': 'Single',\n",
       "   'bond_stereo': 'Not_stereo',\n",
       "   'orig': 'atom2',\n",
       "   'dest': 'atom3'}},\n",
       " {'id': 'CO2',\n",
       "  'software': 'ChemDraw2024',\n",
       "  'version': 'V2000',\n",
       "  'atom1': {'x': -0.72,\n",
       "   'y': 0.0,\n",
       "   'z': 0.0,\n",
       "   'symbol': 'C',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom2': {'x': 0.72,\n",
       "   'y': 0.0,\n",
       "   'z': 0.0,\n",
       "   'symbol': 'O',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'atom3': {'x': -1.44,\n",
       "   'y': 0.0,\n",
       "   'z': 0.0,\n",
       "   'symbol': 'O',\n",
       "   'mass_diff': '0',\n",
       "   'charge': 'outside_limits',\n",
       "   'stereo_parity': 'not_stereo',\n",
       "   'valence': 'no marking'},\n",
       "  'bond0': {'bond_type': 'Double',\n",
       "   'bond_stereo': 'Use_coordinates',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom2'},\n",
       "  'bond1': {'bond_type': 'Double',\n",
       "   'bond_stereo': 'Use_coordinates',\n",
       "   'orig': 'atom1',\n",
       "   'dest': 'atom3'},\n",
       "  'LogP': '0.83'}]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "parse_sdf_file(\"./samples.sdf\",data_items=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "f89bf7f3-13cb-46ef-b274-b32856462cda",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5ace0fae-8839-402f-9f27-778f270e8049",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
